<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $permissions = [


            "الموظفين",
            "اضافه موظف",
            "تعديل موظف",
            "حذف موظف",

            "شيفت",
            "اضافه شيفت",
            "تعديل شيفت",
            "حذف شيفت",

            "تبديل شيفت",

            'تبديل شيفت موظف',
            "اضافه شيفت موظف",
            "تعديل شيفت موظف",
            "حذف  شيفت موظف",

            'تبديل شيفت قسم',
            "اضافه شيفت قسم",
            "تعديل شيفت قسم",
            "حذف  شيفت قسم",


            'اذن',
            "اضافه اذن",
            "تعديل اذن",
            "حذف اذن",


            'اداره بصمات الموظفين',
            "اضافه بصمه موظف",
            "تعديل بصمه موظف",
            "حذف بصمه موظف",


            'طلب اجازه',
            "اضافه اجازه",
            "تعديل اجازه",
            "حذف اجازه",


            "الاقسام",
            "اضافه قسم",
            "تعديل قسم",
            "حذف قسم",


            "الخصم",
            "اضافه خصم",
            "تعديل خصم",
            "حذف خصم",

            "سلف",
            "اضافه سلف",
            "تعديل سلف",
            "حذف سلف",

            'التقرير',

            "تقرير موظف",
            "استيراد ملف موظف",
            "بحث موظف",
            'تقرير اجمالي',


            "تقرير بالقسم",
            "استيراد ملف قسم",
            "بحث القسم",


            "اعدادات المستخدين",


            "المستخدمين",
            "اضافه مستخدم",
            "تعديل مستخدم",
            "حذف مستخدم",


            "الصلاحيات",
            'عرض صلاحية',
            'اضافة صلاحية',
            'تعديل صلاحية',
            'حذف صلاحية',


            'سحب السجلات الهواتف',

            'IP-الاتصال',
            'سحب الموظفين من البصمه',


            'حافز',
            "اضافه حافز",
            "تعديل حافز",
            "حذف حافز",

            "شؤن الموظفين",

            "قرض",
            "اضافه قرض",
            "تعديل قرض",
            "حذف قرض",

            "خصم مواصلات",
            "حذف خصم مواصلات",
            "تعديل خصم مواصلات",
            "اضافه خصم مواصلات",

            "بدل مواصلات",
            "حذف بدل مواصلات",
            "تعديل بدل مواصلات",
            "اضافه بدل مواصلات",

            "التامينات",
            "اضافه تامينات",
            "حذف تامينات",
            "تعديل تامينات",

            "المشتريات",
            "اضافه مشتريات",
            "حذف مشتريات",
            "تعديل مشتريات",


            "ايام العيد",
            "اضافه عيد",
            "تعديل عيد",
            "حذف عيد",


            "عديه العيد",
            "اضافه عديه العيد",
            "تعديل عديه العيد",
            "حذف عديه العيد",

            "طلبات الموظفين ايميل",
            "اداره الوقت الاضافي",





        ];
        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }
    }
}
